RIET/src/Catalogs/СпособыРаспределенияРасходов/СпособыРаспределенияРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыРаспределенияРасходов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Точность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЗагрузкаИРаспределениеРасходов</types>
      <types>DocumentRef.ЗагрузкаРасходовПоЗарплате</types>
    </type>
  </attributes>
  <attributes>
    <name>РучноеОпределениеСуммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РаспределяемыеЗатраты</name>
    <attributes>
      <name>ФактическоеПодразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Расходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрочиеРасходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтраховыеВзносы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВзносыФСС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сегмент</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасходов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AccountLawson</name>
      <type>
        <types>ChartOfAccountsRef.Lawson</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БазаРаспределения</name>
    <attributes>
      <name>НалоговаяРегистрация</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>База</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доля</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокAU</name>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокСегментов</name>
    <attributes>
      <name>Сегмент</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/InformationRegisters/AUsAndLegalEntities/AUsAndLegalEntities.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AUsAndLegalEntities</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>LegalEntity</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </resources>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ParentCompany</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/СегментыКостЦентров/СегментыКостЦентров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СегментыКостЦентров</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>КостЦентр</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </resources>
  <dimensions>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Catalogs/СпособыРаспределенияРасходов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура БазаРаспределенияБазаПриИзменении(Элемент)
	
	ПерезаполнитьПроценты();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПроценты()
	
	ИтогБазы = Объект.БазаРаспределения.Итог("База");
	Для Каждого СтрокаТЧ ИЗ Объект.БазаРаспределения Цикл
		СтрокаТЧ.Доля = Окр(СтрокаТЧ.База / ИтогБазы, Объект.Точность);	
	КонецЦикла;
	Объект.БазаРаспределения[0].Доля = Объект.БазаРаспределения[0].Доля + (1 - Объект.БазаРаспределения.Итог("Доля"))	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоAU(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Документ) Тогда
		Сообщить("Выберите документ.");
		Возврат;
	КонецЕсли;	
	ЗаполнитьПоAUнаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоAUнаСервере()
	
	РаспределяемыеЗатраты = Справочники.СпособыРаспределенияРасходов.ПолучитьСуммуРасходовПоAU(Объект);
	
	Объект.РаспределяемыеЗатраты.Загрузить(РаспределяемыеЗатраты);
	
КонецПроцедуры

// { RGS MYurkevich 25.11.2015 11:11:15 - RCA-0000098
&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Документ) Тогда
		Объект.Период = КонецКвартала(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Документ, "Дата"));
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПоСегментамНаСервере()
	
	РаспределяемыеЗатраты = Справочники.СпособыРаспределенияРасходов.ПолучитьСуммуРасходовПоСегментам(Объект);
	
	Объект.РаспределяемыеЗатраты.Загрузить(РаспределяемыеЗатраты);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоСегментам(Команда)
	ЗаполнитьПоСегментамНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Если Объект.СписокAU.Количество() Тогда
	ПериодПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СправочникКостЦентры.Ссылка КАК AU,
		|	МАКСИМУМ(AUsAndLegalEntities.LegalEntity) КАК PALegalEntity,
		|	МАКСИМУМ(СегментыКостЦентров.Период) КАК Период
		|ИЗ
		|	Справочник.КостЦентры КАК СправочникКостЦентры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AUsAndLegalEntities КАК AUsAndLegalEntities
		|		ПО СправочникКостЦентры.Ссылка = AUsAndLegalEntities.AU
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СегментыКостЦентров КАК СегментыКостЦентров
		|		ПО (СегментыКостЦентров.КостЦентр = СправочникКостЦентры.Ссылка)
		|ГДЕ
		|	СправочникКостЦентры.Код В(&СписокКостЦентров)
		|
		|СГРУППИРОВАТЬ ПО
		|	СправочникКостЦентры.Ссылка";
	СписокКостЦентров = Новый Массив();
	Для Каждого КостЦЕнтр Из Объект.СписокAU Цикл
		СписокКостЦентров.Добавить(КостЦЕнтр.AU.Код);
	КонецЦикла;	
	Запрос.УстановитьПараметр("СписокКостЦентров", СписокКостЦентров);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Свернуть("AU");
	Объект.СписокAU.Очистить();
	Объект.СписокAU.Загрузить(РезультатЗапроса);
КонецПроцедуры
// } RGS MYurkevich 25.11.2015 11:11:15 - RCA-0000098
